server/app/controllers/api/desserts_controller.rb

SELECT "desserts".* FROM "desserts"
---
    def index
        render json: Dessert.all

INSERT INTO "desserts" ("itemname", "description", "price") VALUES ($1, $2, $3) RETURNING "id"  [["itemname", "dessert tasting plate"], ["description", "chefs slection for 2 people"], ["price", 36]]
---
    def create
        dessertitems = Dessert.create(itemname: params[:itemname], price: params[:price], description: params[:description])