server/app/controllers/api/drinks_controller.rb

    def index
        render json: Drink.all
---
SELECT "drinks".* FROM "drinks"

    def create
        drinkitems = Drink.create(itemname: params[:itemname], price: params[:price], description: params[:description])
---
INSERT INTO "drinks" ("itemname", "description", "price") VALUES ($1, $2, $3) RETURNING "id"  [["itemname", "Negroni"], ["description", "Hendricks gin, Campari, sweet Rosso vermouth & twist of orange"], ["price", 19]]