server/app/controllers/api/foods_controller.rb

    def index
        render json: Food.all
---
SELECT "foods".* FROM "foods"

    def create
        fooditems = Food.create(itemname: params[:itemname], price: params[:price], description: params[:description])
---
INSERT INTO "foods" ("itemname", "description", "price") VALUES ($1, $2, $3) RETURNING "id"  [["itemname", "PalakPaneer"], ["description", "Home made cottage cheese cooked in a creamy spinach sauce with fenugreek"], ["price", 23]]