server/app/controllers/api/items_controller.rb

SELECT "items".* FROM "items"
---
    def index
        render json: Item.all

INSERT INTO "items" ("itemname", "price", "noOfItems", "image", "categoryName") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        groceryitems = Item.create(itemname: params[:itemname], price: params[:price], noOfItems: params[:noOfItems], image: params[:image], categoryName: params[:categoryName])

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        puts params[:id]
        render json: Item.find(params[:id])

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "items" SET "itemname" = $1, "price" = $2, "noOfItems" = $3 WHERE "items"."id" = $4  [["itemname", "RedApple"], ["price", 4], ["noOfItems", 69], ["id", 8]]
---
    def update
        groceryitems = Item.find(params[:id])
        groceryitems.update(itemname: params[:itemname], price: params[:price], noOfItems: params[:noOfItems], image: params[:image], categoryName: params[:categoryName])

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 1]]
---
    def destroy
        Item.destroy(params[:id])