server/app/controllers/api/users_controller.rb

INSERT INTO "users" ("name", "password_digest") VALUES ($1, $2) RETURNING "id"  [["name", "Vathsala"], ["password_digest", "$2a$12$7JW4XAlTkdYZzocYrhBCb.RA.w8UG2hc3RPfY2um60Ob5VQpgu8Oq"]]
---
    def create
      user = User.create(user_params)